# List of plugins to be installed

ohmyzsh/ohmyzsh path:lib

# fpath Completions 
zsh-users/zsh-completions
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/poetry
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
$HOME/.cache/oh-my-zsh/completions kind:fpath

# compinit plugins
belak/zsh-utils path:completion

# compdef Completions
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/npm

# Alias only plugins
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/history

# Helper plugins
ohmyzsh/ohmyzsh path:plugins/sudo

zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
